//cin cout обьектыг ашиглахын тулд хамаарагдах санг зааж өгч байна.
#include <iostream>
using namespace std;

/*
функц зарлаж байна.
функцийн нэр: findlargeNumber
функцийн үүрэг: Параметрээр ирсэн 3 тооны ихийг олж буцаах
Функцийн тухай: 3 тооны хамгийн ихийг олох функцыг залаж байна. Хэрэглэгчээс орж ирэх тоо нь
бутархай тоо байж болох тул функцын авч буй a,b,c праметрийн төрлийг float төрлөөр авсан.
Нэгэнт float төрлийн утга орж болох тул float төрлийн утга буцна. Тийм учраас функцийн
буцах утгийн төрлийг float төрөл болгосон.
Хувьсагчдийн үүрэг:
    float a -> Харьцуулах 3 тооны эхний тоог хүлээн авч хадгалах
    float b -> Харьцуулах 3 тооны хоёр дэх тоог хүлээн авч хадгалах
    float c -> Харьцуулах 3 тооны гурав дэх тоог хүлээн авч хадгалах
*/
float findLargestNumber(float a, float b, float c);

// СИ хэлэнд програм main функцээс эхэлж ажиллана.
int main(){
    //Хэрэглэгчээс авах 3 тоогоо хадгалах хувьсагчдыг бэлдэж байна.
    // Хэрэглэгчээс бутархай тоо орж ирж болох тул float төрлөөр зарласан
	float a,b,c;
	//cin объектын >> операторыг ашиглаж a,b,c хувьсагчдад хэрэглэгчээс утга авч байна
	cin>>a>>b>>c;
	// Хэрэглэгчээс авсан утгуудыг 3 тооны ихийг олж буцаадаг функцрүү дамжуулж
	//буцаж ирсэн утгийг cout объектийн << операторыг ашиглаж дэлгэцлэж байна.
	cout<<findLargestNumber(a,b,c);
    return 0;
}
/*
функц зарлаж байна.
функцийн нэр: findlargeNumber
функцийн үүрэг: Параметрээр ирсэн 3 тооны хамгийн ихийг олж буцаах
Арга: 3 тоог жиших аргаар хамгийн ихийг олсон.
Функцийн тухай: 3 тооны хамгийн ихийг олох функцыг залаж байна. Хэрэглэгчээс орж ирэх тоо нь
бутархай тоо байж болох тул функцын авч буй a,b,c праметрийн төрлийг float төрлөөр авсан.
Нэгэнт float төрлийн утга орж болох тул float төрлийн утга буцна. Тийм учраас функцийн
буцах утгийн төрлийг float төрөл болгосон.
Хувьсагчдийн үүрэг:
    float a -> Харьцуулах 3 тооны эхний тоог хүлээн авч хадгалах
    float b -> Харьцуулах 3 тооны хоёр дэх тоог хүлээн авч хадгалах
    float c -> Харьцуулах 3 тооны гурав дэх тоог хүлээн авч хадгалах
    float back -> Хамгийн их тоо буюу функцээс буцах утгийг хадгална
*/
float findLargestNumber(float a,float b,float c){
	//функцээс буцах утга буюу харьцуулалтын үед их тоог хадгалах хувьсагчыг зарлаж байна.
	float back;
	//a хувьсагчийн утга b-с их ба тэнцүү бөгөөд мөн c- ээс их ба тэнцүү нөхцөл үнэн үед
	if(a >= b && a >= c){
        //a хувьсагч бусад b,c хувьсагчаас их ба тэнцүү тул back-д а хувьсагчийн утгийг өгнө
        //энэ нөхцөл биелэсэн тохиолдолд доорх жиших үйлдэлүүд хийгдэгүй.
		back=a;
    //Дээрх нөхцөл биелээгүй нөхцөлд доорх нөхцөл ажиллана
    //b хувьсагчийн утга a-с их ба тэнцүү бөгөөд мөн c- ээс их ба тэнцүү нөхцөл үнэн үед
	}else if(b >= a && b >= c){
        //b хувьсагч бусад a,c хувьсагчаас их ба тэнцүү тул back-д b хувьсагчийн утгийг өгнө
        //энэ нөхцөл биелэсэн тохиолдолд доорх жиших үйлдэлүүд хийгдэxгүй.
		back=b;
    //Дээрх нөхцөл биелээгүй нөхцөлд доорх нөхцөл ажиллана
    //c хувьсагчийн утга a-с их ба тэнцүү бөгөөд мөн b- ээс их ба тэнцүү нөхцөл үнэн үед
	}else if(c >= a && c >= b){
        //c хувьсагч бусад a,b хувьсагчаас их ба тэнцүү тул back-д b хувьсагчийн утгийг өгнө
        //энэ нөхцөл биелэсэн тохиолдолд доорх жиших үйлдэлүүд хийгдэxгүй.
		back=c
	}
	//дээрх жиших үйлдэлүүд хийгдэсний дараа back хувьсагчид 3 тооны хамгйн их утга оноогдсон байна
	//return түлхүүр үгийг ашиглаж функцээс 3 тооны ихийг хадгалж байгаа back хувьсагчийг буцааж байна
	return back;
}
