/*
Даалгавар:
Код бич гэсэн тул хэрэглэгчийн функц зарлаагүй

Шийдэл: Хэрэглэгч хэдэн тооны хамгийн их ба хамгийн багийг олохыг шийдэж утгийг оруулна. Оруулан утгатай ижил утаар массив байгуулна ингэхдээ
массивийг float төрлөөр зарлаж өгсөн ба учир гэвэл хэрэглэгч бутархай тооны их багийг олж болно гэдгийг таамагласан.
хэрэглэгчээс массивийн элемент бүрт утга авна. Үүний дараа массивийн бүх элементийг цикддэж жиших аргаар хамгийн их ба хамгийн багийг олж
байгаа
*/

//cin cout обьектыг ашиглахын тулд хамаарагдах санг зааж өгч байна.
#include <iostream>
using namespace std;



// СИ хэлэнд програм main функцээс эхэлж ажиллана.
int main(){
    //Хэдэн тооны их багийг олох, хэрэглэгчээс хэдэн элемент авах, хэр урттай массив байгуулах зэрэгт ашиглагдах тоог хадгалах
    //хэдэн элемент оруулах вэ эхэд 6.6 буюу бутарай оруулах нь утгагүй тул int төрлөөр зарлав
	int n;
	//Хэрэглэгчид хялбар  байх үүднээс cout объектын << операторыг ашиглаж дэлгэцэн заавар харуулж байна
	cout<<"Heden oron oruulah we?->";
	//cin объектыг ашиглаж n хувьсагчид хэрэглэгчээс утга авч байна. Дараах хувьсагчид оноогдох утга нь дараах зүйлүүдэд ашиглагдана
	//Хэдэн тооны их багийг олох, хэрэглэгчээс хэдэн элемент авах, хэр урттай массив байгуулах зэрэгт ашиглагдах
	cin>>n;
	//Хэрэглээс авсан утгын адил хэмжээгээр нийт тоог хадгалах массив зарлаж байна.
	//Хэрэглэгч бутархай тооны их багийг олж болох магадлалтай тул float төрлөөр массив байгуулав
	float a[n];

    /*
    Доорх for давталтаар дээрх зарласан массивт хэрэглээс утга авч байна. Давталт дуусхад хэрэглээс n удаа утга авч массивийн 0-ээс(n-1)
    индекст хадгалсан байна.
    Хувьсагчийн тайлбар:
        i- давталтын тоолуур
        n- давталтын хязгаар
    давталт биелэх нөхцөл: i нь n-с бага үед
    давталт биелэх тоо: n-1 (массив 0-с эхлэж индекслдэг тул)
    */
	for(int i=0;i<n;i++){
        //cin объектын >> оператороор a массивын i-р элементэд утга авч байна.
	    cin>>a[i];
	}

    /*
    Массиваас олох хамгийн их ба бага тоог хадгалах хувьсагчдыг бэлдэж байна. Их ба бага тоо бутархай байж болох тул float төрлөөр
    зарлаад массивийн эхний элементийн хамгийн их ба хамгийн бага гэж авч үзэж байна.
    */
	float baga=a[0], ih=a[0];

	/*
	Хувьсагчийн тайлбар:
        i- давталтын тоолуур
        n- давталтын хязгаар
        baga - жиших үйлдэл бүрт бага утгийг хадгална. Давталт дуусхад хамгийн бага утга оноогдсон байх хувьсагч
        ih - жиших үйлдэл бүрт их утгийг хадгална. Давталт дуусахад хамгийн их утга оноогдсон байх хувьсагч
    Давталт биеэх нөхцөл: i нь n-с бага үед
    давталт биелэх тоо: n-1 (массив 0-с эхлэж индекслдэг тул)
	*/
	for(int i=0;i<n;i++){
        //a-н i-р элемент baga- хувьсагчийн утгаас бага бавал нөхцөл биелэнэ
		if(a[i]<baga){
		    //baga -д a[i] -р елементийг өгч байна.
			baga=a[i];
		}
        //a-н i-р элемент ih- хувьсагчийн утгаас их бавал нөхцөл биелэнэ
		if(a[i]>ih){
		    //ih -д a[i] -р елементийг өгч байна.
			ih=a[i];
		}
	}
	//count объектийн << операторыг ашиглаж ih ба baga хувьсагчын утгиг дэлгэцлэж байна
	//endl нь догол мөрөнд шилжүүлдэг
	cout<<"ih: "<<ih<<"\nbaga: "<<baga<<endl;

	return 0;
}
