//cin cout обьектыг ашиглахын тулд хамаарагдах санг зааж өгч байна.
#include <iostream>
using namespace std;
/*
Үйлдэл: Функц зарлаж байна
Функцийн нэр: findEvenNumber
Функцийн үүрэг: Хэрэглэгчээс өгөгдсөн тоон цуваанд хэдэнд тэгш тоо байгааг олж буцаах
функцийн тухай: Функц нь массивийн хаяг болон уртыг параметрээр авч дотрох элементүүдийг
2-р үлдэгдэлтэй хувааж үлдэгдэлийг жиших аргаар тэгш тоог олно.
Хувьсагчийн үүрэг:
    a - хаяган хувьсагч, эх функцээс массивийн хаяг ирэхэд хадгалах
    n - массивийн урт
*/
int findEvenNumber(int *a,int n);

// СИ хэлэнд програм main функцээс эхэлж ажиллана.
int main(){
    //Хэдэн тооноос тэгш тоог хайх, хэрэглэгчээс хэдэн элемент авах, хэр урттай массив байгуулах зэрэгт ашиглагдах тоог хадгалах
    //хэдэн элемент оруулах вэ эхэд 6.6 буюу бутарай оруулах нь утгагүй тул int төрлөөр зарлав
	int n;
	//Хэрэглэгчид хялбар  байх үүднээс cout объектын << операторыг ашиглаж дэлгэцэн заавар харуулж байна
	cout<<"Heden oron oruulah we?->";
	//cin объектыг ашиглаж n хувьсагчид хэрэглэгчээс утга авч байна. Дараах хувьсагчид оноогдох утга нь дараах зүйлүүдэд ашиглагдана
	//Тэгш тоог хайх нийт тоо, хэрэглэгчээс хэдэн элемент авах, хэр урттай массив байгуулах зэрэгт ашиглагдах
	cin>>n;
	//Хэрэглээс авсан утгын адил хэмжээгээр нийт тоог хадгалах массив зарлаж байна.
	int a[n];

    /*
    Доорх for давталтаар дээрх зарласан массивт хэрэглээс утга авч байна. Давталт дуусхад хэрэглээс n удаа утга авч массивийн 0-ээс(n-1)
    индекст хадгалсан байна.
    Хувьсагчийн тайлбар:
        i- давталтын тоолуур
        n- давталтын хязгаар
    давталт биелэх нөхцөл: i нь n-с бага үед
    давталт биелэх тоо: n-1 (массив 0-с эхлэж индекслдэг тул)
    */
	for(int i=0; i<n; i++){
        //cin объектын >> оператороор a массивын i-р элементэд утга авч байна.
	    cin>>a[i];
	}
	// cout объектын << операторыг ашиглаж дэлгэцэнд findEvenumber функцээс буцаж ирэх хариуг дэлгэцлэж байна.
	cout<<"Tegsh - "<<findEvenNumber(a,n);
	return 0;
}

/*
Үйлдэл: Функц тодорхойлж байна
Функцийн нэр: findEvenNumber
Функцийн үүрэг: Хэрэглэгчээс өгөгдсөн тоон цуваанд хэдэнд тэгш тоо байгааг олж буцаах
функцийн тухай: Функц нь массивийн хаяг болон уртыг параметрээр авч дотрох элементүүдийг
2-р үлдэгдэлтэй хувааж үлдэгдэлийг жиших аргаар тэгш тоог олно.
Хувьсагчийн үүрэг:
    a - хаяган хувьсагч, эх функцээс массивийн хаяг ирэхэд хадгалах
    n - массивийн урт
    total - нийт хэдэн тэгш тоо байгааг хадгалах
*/

int findEvenNumber(int *a, int n){
	//хүснэгтэнд нийт хэдэн тэгш утгатай элемент байгааг хадгалахь 0
	//0 тэй тэнцүүлж байгаа нь санах ойг хуваарьлахад дотор нь дурын элемент байж болох тул
	int total=0;
	/*
    Доорх for давталтаар параметрээр орж ирсэн массивийн элемент бүрийг тэгш эсэхийг шалгаж мөн байвал total-г 1-р нэмэгдүүлнэ.
    Давталт дуусхад total-д массивт нийт тэгш тоо байгааг буцааны.
    Хувьсагчийн тайлбар:
        i- давталтын тоолуур
        n- давталтын хязгаар
        total - нийт хэдэн тэгш тоо байгааг хадгалах нэмэгдүүлэх
    давталт биелэх нөхцөл: i нь n-с бага үед
    давталт биелэх тоо: n-1 (массив 0-с эхлэж индекслдэг тул)
    */
	for(int i=0;i<n;i++){
        //a-н i-р элементийн утгийг 2-р үлдэгдэлтэй хуваагаад үлдэгдэл нь 0 тэй тэнцүү байва тэгш гэж үзэж
        //total-г нэгээр нэмэгдүүлнэ
		if(a[i]%2==0)total++;
	}
	//функ total-н утгийг буцааж байна
	return total;
}

