//cin cout обьектыг ашиглахын тулд хамаарагдах санг зааж өгч байна.
#include <iostream>
using namespace std;

/*
Үйлдэл: Функц зарлаж байна
Функцийн нэр: findOddNumber
Функцийн үүрэг: Параметрээр ирсэн тоо сондгой мөн эсэхийг шалгах
функцийн тухай: Параметрээр ирсэн тоог 2-р үлдэгдэлтэй хувааж үлдэгдэл нь 0 тэй тэнцүү биш байвал сондгой мөн гэж үзэж
1-г буцаана эсрэг тохиолдолд 0-г буцаана
Хувьсагчийн үүрэг:
    a - Сондгой мөн эсэхийг шалгах тоо
*/
int findOddNumber(int a);

/*
Үйлдэл: Функц зарлаж байна
Функцийн нэр: average
Функцийн үүрэг: Параметрээр орж ирсэн тооны дундаж утгыг олж буцаах
функцийн тухай: Параметрээр дундаж утгийг олох тоо болон хэдэн тооны нийлбэр болох тоо нь орж ирэх тул
дундажийг олох тоог хэдэн тооны нийлбэрийг зааж байгаа тоонд хувааж буцаана. дундаж бутархай тоо байж болох тул
функцын буцах утгыг float төрөлтэй болгосон.
Хувьсагчийн үүрэг:
    a - дундаж утгийг олох тоог хадгалах
    n - a нь хэдэн тооны нийлбэр болохыг зааж буй тоог хадгалах
*/
float average(int a,int n);

// СИ хэлэнд програм main функцээс эхэлж ажиллана.
int main(){
    //Хэдэн тооноос соднгой тоох хайх, хэрэглэгчээс хэдэн элемент авах, хэр урттай массив байгуулах зэрэгт ашиглагдах тоог хадгалах
    //хэдэн элемент оруулах вэ эхэд 6.6 буюу бутарай оруулах нь утгагүй тул int төрлөөр зарлав	int n;
    int n;

	//Хэрэглэгчид хялбар  байх үүднээс cout объектын << операторыг ашиглаж дэлгэцэн заавар харуулж байна
	cout<<"Heden too oruulah we?->";

	//cin объектыг ашиглаж n хувьсагчид хэрэглэгчээс утга авч байна. Дараах хувьсагчид оноогдох утга нь дараах зүйлүүдэд ашиглагдана
	//Тэгш тоог хайх нийт тоо, хэрэглэгчээс хэдэн элемент авах, хэр урттай массив байгуулах зэрэгт ашиглагдах
	cin>>n;

	//Хэрэглээс авсан утгын адил хэмжээгээр нийт тоог хадгалах массив зарлаж байна.
	int a[n];

    /*
    Доорх for давталтаар дээрх зарласан массивт хэрэглээс утга авч байна. Давталт дуусхад хэрэглээс n удаа утга авч массивийн 0-ээс(n-1)
    индекст хадгалсан байна.
    Хувьсагчийн тайлбар:
        i- давталтын тоолуур
        n- давталтын хязгаар
    давталт биелэх нөхцөл: i нь n-с бага үед
    давталт биелэх тоо: n-1 (массив 0-с эхлэж индекслдэг тул)
    */
	for(int i=0; i<n; i++){
        //cin объектын >> оператороор a массивын i-р элементэд утга авч байна.
	    cin>>a[i];
	}

    //count - нийт хэдэн сондгой тоо байгааг хадгала
    //total - нийт сондгой тооны нийлбэр
	int count=0,total=0;

	/*
    Доорх for давталтаар массивт байгаа нийт сондгой элемент болон тэдгээрийн нийлбэрийг олно.
    Хувьсагчийн тайлбар:
        i- давталтын тоолуур
        n- давталтын хязгаар
    давталт биелэх нөхцөл: i нь n-с бага үед
    давталт биелэх тоо: n-1 (массив 0-с эхлэж индекслдэг тул)
    */
	for(int i=0;i<n;i++){
        //findOddNumber функрүү a -н i-р элементийг дамжуулж сондгой мөнх эсэхийг шалгаж байна мөн байвал нөхцөл биелэнэ.
	    if(findOddNumber(a[i])){
	        //a[i] сондгой тул total дээр нэмнэ.
	       total+=a[i];
            //сондго тоо тул  count-г 1-р нэмэгдүүлнэ.
	       count++;
	    }
	}
    //cout объектийн << оператороор average функцээс буцаж ирэх тоон цувааны сондгой тооны дундажийг дэлгэцлэж байна.
	cout<<"Dundaj: "<<average(total,count);
	return 0;
}
/*
Үйлдэл: Функц тодорхойлж байна
Функцийн нэр: findOddNumber
Функцийн үүрэг: Параметрээр ирсэн тоо сондгой мөн эсэхийг шалгах
функцийн тухай: Параметрээр ирсэн тоог 2-р үлдэгдэлтэй хувааж үлдэгдэл нь 0 тэй тэнцүү биш байвал сондгой мөн гэж үзэж
1-г буцаана эсрэг тохиолдолд 0-г буцаана
Хувьсагчийн үүрэг:
    a - Сондгой мөн эсэхийг шалгах тоо
*/
int findOddNumber(int a){
    if(a%2!=0) return 1;
    return 0;
}

/*
Үйлдэл: Функц тодорхойлж байна
Функцийн нэр: average
Функцийн үүрэг: Параметрээр орж ирсэн тооны дундаж утгыг олж буцаах
функцийн тухай: Параметрээр дундаж утгийг олох тоо болон хэдэн тооны нийлбэр болох тоо нь орж ирэх тул
дундажийг олох тоог хэдэн тооны нийлбэрийг зааж байгаа тоонд хувааж буцаана. дундаж бутархай тоо байж болох тул
функцын буцах утгыг float төрөлтэй болгосон.
Хувьсагчийн үүрэг:
    a - дундаж утгийг олох тоог хадгалах
    n - a нь хэдэн тооны нийлбэр болохыг зааж буй тоог хадгалах
*/
float average(int a, int n){
    return a/n;
}

