#include<iostream>
using namespace std;
int main() {
	    // Бүхэл тоон a хувьсагч зарлаж түүнд 125 утгыг оноож байна
int a = 125;
	// Бүхэл тоон төрлийн p заагчин хувьсагч зарлаж түүнд a хувьсагчийн хаягийг хаягийн оператор &-н тусламжтайгаар оноож байна
	int *p = &a;
	// p заагчин хувьсагчийн агуулж буй хаягийг хэвлэж байна
cout<<p;
	// p заагчин хувьсагчийн агуулж буй хаяг доторх утгийг хэвлэж байна
	cout<<*p;
	//p-г дараагийн санах ойд шилжүүлнэ. Ингэхдээ p-г илэрхийлж буй өгөгдлийн төрлийн санах ойд эзлэх хэмжээг p-н хэмжээ дээр нэмнэ. Энэ тохиолдолд int нь 4 байт тул хаяг 180 байсан гэхэд 184 дээр байна гэсэн үг
	p++;
	// p-н өөрчлөгдсөн хаягийг хэвлэж байна
	cout<<p;
	// p-н өөрчлөгдсөн хаяг дээрх утгийг хэвлэж байна.
	// энэ хаягт утга оноогоогүй учир санах ойн хог хэвлэнэ.
	cout<<*p;
}
