#include<iostream>
using namespace std;
int main() {
//зургаан элементтэй бүхэл тоон төрлийн numbers хувьсагч үүсгэж байна
int numbers[5];
// бүхэл тоон төрлийн p заагч хувьсагч зарлаж байна
int * p;
//p-д numbers массивын эхний элементийн хаягийг олгоод тус хаяг дотрох утган 10 –г оноож байна.
p = numbers; * p = 10;
//p доторх хаягийг 4 байтаар нэмэгдүүлж(int төрлийн массив тол 1-р нэмэгдүүлнэ гэдэг нь хаяган дээр 4-г нэмнэ гэсэн үг) тус нэмэгдүүлсэн хаягийн доторох утганд 20 –г оноож байна.
p++; * p = 20;
// p-д numbers хүснэгтийн 2-р индексийн хаягийг олгоод. Тус хаяг доторх утганд 30-г олгож байна.
p = & numbers[2]; * p = 30;
// p-д numbers хүснэгтийн эхний элементийн хаяг дээр 3-г нэмээд тус хаягийг олгоод p доторх хаяг дээрх утганд 40-г олгоэо.
p = numbers + 3; * p = 40;
//p-д numbers хүснэгтийн эхний хаягийг зааж өгөөд p + 4 буюу эхний хаяг дээр 4-г нэмээд гарсан хаягийг утгад 50-г олгож байна
p = numbers; * (p + 4) = 50;
//Давталтын тоолуурыг 0 болгоод n<5 нөхцөлд үнэн үед биелэнэ.
for (int n = 0; n < 5; n++) {
//numbers –н n-р элементийг хэвлэж байна
cout << numbers[n] << ", ";
}
