#include<iostream>

using namespace std;

class Matrix{
    private:
    //Матрицийн мөр, баганы хэмжээг хадгалах гишүүн өгөгдөл
        int row,col;
    //Матрицийн бүх утгыг хадгалах хаяган хувьсагч
        float *values;

    public:
    /*
    Параметртэй байгуулагч 
    параметр:
        row - матрицийн мөр 
        col - матрицийн багана
    үүрэг: мөр баганы хэмжээтэй ойг нөөцлөх
    */
    Matrix(int row,int col);
    /*
    Нэмэх операторыг матриц нэмэх үйлдэл хийдэг 
    байхаар дахин тодорхойлж байна.
    хоёр матрицийг нэмээд нэмэгдсэн матрицийг буцаана
    */
    Matrix operator +(Matrix &a);
    /*
    + операторыг матриц скаляраар нэмэх үйлдэл хийдэг
    байхаар дахин тодорхойлж байна.
    Параметрээр орж ирсэн тогтмол тоог матрицийн бүх 
    элемент дээр нэмэх үйлдэл хийнэ.
    нэмээд нэмэгдсэн матрицийг буцаана
    */
    Matrix operator +(float &a);
    /*
    * операторыг матриц үрчих үйлдэл хийдэг байхаар
    дахин тодорхойлж байна. 
    Матрицийг нэмээд нэмэгдсэн матрицийг буцаана
    */
    Matrix operator *(Matrix &a);
    /*
    - операторыг матриц хасах үйлэл хийдэг байхаар 
    дахин тодорхойлж байна.
    операторыг дуудсан матрицаас параметрээр орж ирэх 
    матрицийг хасаад хариуг илгээнэ.
    */
    Matrix operator -(Matrix &a);
    /*
    Дуудсан матрицад тэмдэгийн ар талын матрицийг 
    хуулах үйлдэл хийдэг байхаар дахин тодрхойлно.
    */
    Matrix& operator =(Matrix a);
    /*
    ++ операторыг матрицийн бүх элементийг нэгээр 
    нэмэгдүүлж дуудсан матрицад хадгална. Нэг матриц
    дээр үйлдэл хийж өөрт нт утга оноох тул утга
    буцаахгүй гэж үзсэн.
    */
    void operator ++(int);
    /*
    -- оператор нь матрицийн бүх элементээс хорогдуулах
    үүргээр дахин тодорхойлж байна. Тухайн матриц дээр
    үйлдэл хийж үр дүнг нь өөрт оноох тул утга буцаах 
    шаардлагагүй гэж үзсэн.
    */
    void operator --(int);
    /*
    нэмэх тэнцүү оператор нь энгийн нэмэх оператортой
    ижил үүрэг гүйцэх боловч ямар нэгэн утга буцаахгүй
    Операторын зүүн талын матриц дээр баруун талын
    матрицийг нэмэж зүүн талын матрицад хариуг олгох
    үйлдэлийг хийхээр дахин тодорхойлсон.
    */
    void operator +=(Matrix &a);
    /*
    хасах тэнцүү оператор нь энгийн хасах оператортой
    ижил үүрэг гүйцэх боловч ямар нэгэн утга буцаахгүй
    Операторын зүүн талын матрицаас баруун талын
    матрицийг хасаж зүүн талын матрицад хариуг олгох
    үйлдэлийг хийхээр дахин тодорхойлсон.
    */
    void operator -=(Matrix &a);
    //TODO: Санах ойн цоорхой шалгах
    /*
    үржих тэнцүү оператор нь энгийн үржих оператортой
    ижил үүрэг гүйцэх боловч ямар нэгэн утга буцаахгүй
    Операторын зүүн талын матрицийг баруун талын
    матриц үржиж зүүн талын матрицад хариуг олгох
    үйлдэлийг хийхээр дахин тодорхойлсон.
    */
    void operator *=(Matrix &a);
    /*
    ! Операторыг матрициг хөрвүүлэх үйлдэлийг хийдэг
    байхаар дахин тодорхойлсон. Матрицийн мөриг багана 
    баганыг мөр болгож хувиргана.
    */
    bool operator !(void);
    /*
    [] Операторыг тухайн матрицийн тухайн
    элементийн утгыг илгээдэг байхаар дахин тодорхойлсон
    */
    float* operator [](int a);
    /*
    Устгагч
    Матрицийн утгыг хадгалж буй values хаяган хувьсагчийн
    эзэмшиж буй ойг чөлөөлөх үйлдэлийг хийж байгаа.
    */
    ~Matrix();
    /*
    Тухайн функц нь дуудагдсан объектын утгийг 
    хэвлэх үүрэгтэй.
    */
    void display();
    /*
    Тухайн матрицин баганын тоог буцаана
    */
    int getCol();
    /*
    Тухайн матрицийн мөрийн тоог буцаана
    */
    int getRow();
    /*
    Матрицийн утгыг хадгалж буй хаяган хувьсагчийн
    эхлэл хаягийг буцаана
    */
    float* getAllValuess();
    /*
    Тухайн мөр баганад байгаа утгыг буцаах
    функц
    */
    float getValues(int *row, int *col);
    /*
    тухайн мөрөнд байх бүх элементийн хаягийг 
    буцаана
    */
    float* getValues2(int *row, int *col);

    /*
    Матрицийн бүх гишүүн өгөгдөл зэрэг утга оноох функц
    */
    void setAll(int *row, int *col, float *values);
    /*
    Матрицин мөрний утгыг өөрчлөх функц
    */
    void setRow(int *row);
    /*
    Матрицийн баганад утга оноох функц
    */
    void setCol(int *col);
    /*
    Матрицийн тухайн мөр баганад утга оноох функц
    */
    void setValues(int *row, int *col, float *values);
};

